/*********************************************************************************************************************
Задача 2: Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.
a = 5; b = 7 -> max = 7
a = 2 b = 10 -> max = 10
a = -9 b = -3 -> max = -3

**********************************************************************************************************************/
int num_1;
int num_2;

Console.WriteLine("Введите первое целое число: ");
num_1 = int.Parse(Console.ReadLine());
Console.WriteLine("Введите второе целое число: ");
num_2 = int.Parse(Console.ReadLine());

if (num_1 > num_2)
{
    Console.WriteLine("Первое число " + num_1 + " больше, чем второе " + num_2);
}
else
{
    Console.WriteLine("Второе число " + num_2 + " больше, чем первое " + num_1);
}